Revit 2026 API

# ColorFillLegendSetColumnWidths Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetColumnWidths(
	IList<double> widths
)
```
```vb
Public Sub SetColumnWidths (
	widths As IList(Of Double)
)
```
```cpp
public:
void SetColumnWidths(
	IList<double>^ widths
)
```
```fsharp
member SetColumnWidths :
        widths : IList<float> -> unit
```

#### Parameters

widths IListDouble

#### Reference

ColorFillLegend Class

Autodesk.Revit.DB Namespace